Revit 2023 API
ReinforcementSettings.SetReinforcementAbbreviationTag Method
 Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public void SetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType,
	string abbreviationTag
)
Visual Basic
Public Sub SetReinforcementAbbreviationTag ( _
	tagType As ReinforcementAbbreviationTagType, _
	abbreviationTag As String _
)
Visual C++
public:
void SetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType,
	String^ abbreviationTag
)
Parameters
tagType
Type: Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType
 Defines the type of abbreviation tag.
abbreviationTag
Type: System.String
 Abbreviation tag value to set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The abbreviation type tagType is not valid
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace